In [3]:
import numpy as np
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt

%matplotlib inline

C:\Users\vishal.kumar1\AppData\Local\Continuum\anaconda3\lib\importlib\_bootstrap.py:219: RuntimeWarning: numpy.ufunc size changed, may indicate binary incompatibility. Expected 192 from C header, got 216 from PyObject
  return f(*args, **kwds)
C:\Users\vishal.kumar1\AppData\Local\Continuum\anaconda3\lib\importlib\_bootstrap.py:219: RuntimeWarning: numpy.ufunc size changed, may indicate binary incompatibility. Expected 192 from C header, got 216 from PyObject
  return f(*args, **kwds)
C:\Users\vishal.kumar1\AppData\Local\Continuum\anaconda3\lib\importlib\_bootstrap.py:219: RuntimeWarning: numpy.ufunc size changed, may indicate binary incompatibility. Expected 216, got 192
  return f(*args, **kwds)
C:\Users\vishal.kumar1\AppData\Local\Continuum\anaconda3\lib\importlib\_bootstrap.py:219: RuntimeWarning: numpy.ufunc size changed, may indicate binary incompatibility. Expected 192 from C header, got 216 from PyObject
  return f(*args, **kwds)

In [10]:
titanic_data=pd.read_csv('titanic1.csv')

In [11]:
titanic_data.head()

,PassengerId,Name,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,1,"Braund, Mr. Owen Harris",3,male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,"Heikkinen, Miss. Laina",3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,female,35.0,1,0,113803,53.1000,C123,S,1
4,5,"Allen, Mr. William Henry",3,male,35.0,0,0,373450,8.0500,NaN,S,0

In [7]:
titanic.columns

Index(['PassengerId', 'Name', 'Pclass', 'Sex', 'Age', 'SibSp', 'Parch',
       'Ticket', 'Fare', 'Cabin', 'Embarked', 'Survived'],
      dtype='object')

In [12]:
titanic_data.drop(columns=['Name','SibSp', 'Parch','Ticket', 'Cabin', 'Embarked',],axis=1,inplace=True)

In [14]:
titanic_data.head()

   PassengerId  Pclass     Sex   Age     Fare  Survived
0            1       3    male  22.0   7.2500         0
1            2       1  female  38.0  71.2833         1
2            3       3  female  26.0   7.9250         1
3            4       1  female  35.0  53.1000         1
4            5       3    male  35.0   8.0500         0

In [16]:
X=titanic_data.drop(columns=['Survived','PassengerId'],axis=1)
y=titanic_data['Survived']

In [23]:
X.isna().any()

Pclass    False
Sex       False
Age        True
Fare      False
dtype: bool

In [24]:
X.Age[:10]

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5     NaN
6    54.0
7     2.0
8    27.0
9    14.0
Name: Age, dtype: float64

To fill these NaN values, there are many methods, and one of them is filling the missing values with mean

In [25]:
X['Age'].fillna(value=X['Age'].mean(), inplace=True)

In [26]:
X['Age'][:10]

0    22.000000
1    38.000000
2    26.000000
3    35.000000
4    35.000000
5    29.699118
6    54.000000
7     2.000000
8    27.000000
9    14.000000
Name: Age, dtype: float64

In [27]:
X.isna().any()

Pclass    False
Sex       False
Age       False
Fare      False
dtype: bool

In [28]:
from sklearn.model_selection import train_test_split

In [29]:
X_train,X_test,y_train,y_test=train_test_split(X,y,test_size=0.2)

In [31]:
#This can be used for a normal distribution data
from sklearn.naive_bayes import GaussianNB

In [32]:
model_titanic=GaussianNB()

In [33]:
model_titanic.fit(X_train,y_train)

ValueError: could not convert string to float: 'male'

The above error is coming because the Sex column is a string and hence ML model cannot work with this. So we will be using one hot encoding for this variable

In [35]:
encoded_data=pd.get_dummies(X['Sex'])

In [36]:
X = pd.concat((X,encoded_data),axis=1)

In [37]:
X.head()

   Pclass     Sex   Age     Fare  female  male
0       3    male  22.0   7.2500       0     1
1       1  female  38.0  71.2833       1     0
2       3  female  26.0   7.9250       1     0
3       1  female  35.0  53.1000       1     0
4       3    male  35.0   8.0500       0     1

In [38]:
X.drop(columns='Sex', axis=1,inplace=True)

In [39]:
X.head()

   Pclass   Age     Fare  female  male
0       3  22.0   7.2500       0     1
1       1  38.0  71.2833       1     0
2       3  26.0   7.9250       1     0
3       1  35.0  53.1000       1     0
4       3  35.0   8.0500       0     1

In [52]:
X_train,X_test,y_train,y_test=train_test_split(X,y,test_size=0.2)

In [53]:
model_titanic1=GaussianNB()

In [54]:
model_titanic1.fit(X_train,y_train)

GaussianNB(priors=None, var_smoothing=1e-09)

In [55]:
model_titanic1.score(X_test,y_test)

0.8324022346368715

In [56]:
X_test[:10]

     Pclass        Age     Fare  female  male
693       3  25.000000   7.2250       0     1
1         1  38.000000  71.2833       1     0
249       2  54.000000  26.0000       0     1
494       3  21.000000   8.0500       0     1
136       1  19.000000  26.2833       1     0
316       2  24.000000  26.0000       1     0
354       3  29.699118   7.2250       0     1
23        1  28.000000  35.5000       0     1
90        3  29.000000   8.0500       0     1
102       1  21.000000  77.2875       0     1

In [60]:
y_test[:10]

693    0
1      1
249    0
494    0
136    1
316    1
354    0
23     1
90     0
102    0
Name: Survived, dtype: int64

In [61]:
model_titanic1.predict(X_test[:10])

array([0, 1, 0, 0, 1, 1, 0, 0, 0, 0], dtype=int64)